---
kind: method
id: M:Autodesk.Revit.DB.LinearArray.IsValidArraySize(System.Int32)
source: html/ed3cd48f-714f-b183-40e9-904672a47aa6.htm
---
# Autodesk.Revit.DB.LinearArray.IsValidArraySize Method

This indicates whether the input count is valid.

## Syntax (C#)
```csharp
public static bool IsValidArraySize(
	int count
)
```

## Parameters
- **count** (`System.Int32`) - The count.

## Returns
True if the input count is between 2 and 200, false otherwise.